<!DOCTYPE html>
<html lang="es">

<head>
    <meta charset="UTF-8" />
    <meta http-equiv="X-UA-Compatible" content="IE=edge" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css" rel="stylesheet"
        integrity="sha384-EVSTQN3/azprG1Anm3QDgpJLIm9Nao0Yz1ztcQTwFspd3yD65VohhpuuCOmLASjC" crossorigin="anonymous" />
    <link rel="stylesheet" href="https://cdn.datatables.net/1.13.1/css/jquery.dataTables.min.css">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.2.1/css/all.min.css">
    <title>Primera asignaci&oacute;n</title>
</head>

<body id="page-top">
    <nav class="navbar navbar-expand-lg navbar-dark bg-dark sticky-top">
        <div class="container-fluid">
            <a class="navbar-brand" href="#">Navegaci&oacute;n</a>
            <button class="navbar-toggler" type="button" data-bs-toggle="collapse"
                data-bs-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false"
                aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse navbar-collapse" id="navbarSupportedContent">
                <ul class="navbar-nav me-auto mb-2 mb-lg-0">
                    <li class="nav-item">
                        <a class="nav-link active" aria-current="page" href="#bio">Biograf&iacute;a</a>
                    </li>
                    <li class="nav-item">
                        <a class="nav-link" href="#nombres">Nombre completo</a>
                    </li>
                    <li class="nav-item dropdown">
                        <a class="nav-link dropdown-toggle" href="#" id="navbarDropdown" role="button"
                            data-bs-toggle="dropdown" aria-expanded="false">
                            Habilidades t&eacute;cnicas
                        </a>
                        <ul class="dropdown-menu" aria-labelledby="navbarDropdown">
                            <li><a class="dropdown-item" href="#carrera">Carrera</a></li>
                            <li><a class="dropdown-item" href="#lenguajes">Lenguajes de programaci&oacute;n y
                                    frameworks</a></li>
                        </ul>
                    </li>
                    <li class="nav-item">
                        <a class="nav-link" href="#expect">Expectativas</a>
                    </li>
                    <li class="nav-item">
                        <a class="nav-link" href="#hobbies">Hobbies</a>
                    </li>
                </ul>
            </div>
        </div>
    </nav>

    <div class="container-fluid">
        <section id="bio"><br>
            <h3 class="text-center">Mi biograf&iacute;a</h3>
            <p class="text-start">
                Nac&iacute; en San Salvador el 19-12-2001, junto a mis padres y mis 2 hermanas mayores vivimos en la
                colonia
                de Altavista, mi padre trabajaba en una compa&ntilde;&iacute;a de autobuses y mi madre en una
                f&aacute;brica
                de calzado, mis 2 hermanas estudiaban a&uacute;n en 7mo y 5to grado. Pero nos mudamos en el a&ntilde;o
                2003, partimos
                hacia el departamento de Sonsonate en el municipio de Santo Domingo de Guzm&aacute;n, viviendo en una
                casa que mi abuela materna
                le cedi&oacute; a mi madre y hemos estado aqu&iacute; desde entonces. Ya viviendo aqu&iacute; mis padres
                se dedicaron
                a cosas diferentes, mi padre por su parte trabaja en su negocio propio donde vende suministros
                b&aacute;sicos entre
                otros productos a fines de la ganader&iacute;a y agricultura, mi madre se ha dedicado a todo lo que
                conlleva ser
                responsable de un hogar, por lo cual mi infancia temprana se resume en la crianza de mi mam&aacute; y
                convivencia
                con mi abuela materna, ya que ella fue nuestra vecina todos estos a&ntilde;os.Yo comenc&eacute; mis
                estudios de kinder en el a&ntilde;o 2008
                en el Complejo Educativo de Santo Domingo de Guzm&aacute;n y finalic&eacute; hasta 6to grado,
                posteriormente
                continu&eacute; desde 7mo hasta 9no en el Colegio Salarru&eacute; de el municipio de Sonsonate.
            </p>

            <p class="text-start">
                Estudi&eacute; en el Colegio Salarru&eacute; bachillerato t&eacute;cnico en desarrollo de software,
                comenzando en el a&ntilde;o
                2018 y finalizando en el 2020, en todos esos a&ntilde;os de estudio pasaron ciertos sucesos de mayor y
                menor importancia en
                mi vida al fin de cuentas, siendo uno de esos momentos a resaltar un accidente automovil&iacute;stico en
                el que estuvimos
                implicados mi pap&aacute; y yo, fue en el a&ntilde;o 2018 en el cual lastimosamente yo al ir manejando
                perd&iacute; el control
                del veh&iacute;culo resultando en da&ntilde;os materiales nada m&aacute;s, otro suceso importante que
                ocurri&oacute; en el mismo
                a&ntilde;o fue la muerte de mi abuela de parte de pap&aacute;, llegando a fallecer por una enfermedad
                del cerebro. En mi primer
                a&ntilde;o de bachillerato aprend&iacute; sobre los principios de la l&oacute;gica de la
                programaci&oacute;n, bases de la web entre otros,
                sin nada m&aacute;s que resaltar en ese a&ntilde;o, los siguientes siguieron la misma trayectoria, hasta
                el cambio importante
                que supuso el inicio de la pandemia que b&aacute;sicamente a consecuencia realic&eacute; mi
                &uacute;ltimo a&ntilde;o de
                manera completamente virtual, a&uacute;n as&iacute; realizamos en grupo y como proyecto final un sistema
                de ventas y
                facturaci&oacute;n a una empresa local en plataforma para escritorio basado en C# con .NET y los
                objetivos fueron cumplidos.
            </p>
            <p class="text-start">
                Como consecuencia de la pandemia y el virus de COVID-19, en el a&ntilde;o 2021 tuvimos otra
                p&eacute;rdida, siendo esta vez
                mi abuela materna, quien siempre hab&iacute;a sido muy cercana a nosotros y apoyado en lo que estaba a
                su alcance, sin duda
                fue un golpe muy importante en mi vida.
                En el per&iacute;odo de 2021-2022 estudi&eacute; la carrera de t&eacute;cnico en ingenier&iacute;a de
                sistemas
                inform&aacute;ticos en el ITCA, finalizando en este a&ntilde;o corriente. Ahora realizando una
                pasant&iacute;a en la
                empresa Creativa Consultores, para poder extender mi conocimiento y a la vez cumplir con un requisito de
                graduaci&oacute;n
            </p>
        </section>

        <hr>

        <section id="nombres" class="text-center"><br>
            <h3>Mis nombres</h3>
            <p>
                Mi nombre completo es: <b>Nelson Gabriel Guevara Linares</b>, siento Nelson por el hermano de mi
                mam&aacute; y Gabriel
                por mi abuelo paterno.
            </p>
        </section>

        <hr>

        <section id="carrera" class="text-center"><br>
            <h3>Carrera estudiada</h3>
            <p>
                Estudi&eacute; <b>t&eacute;cnio de ingenier&iacute;a en sistemas inform&aacute;ticos en ITCA</b>
                <img src="resources/itca.png" width="148px" height="172px" class="rounded mx-auto d-block" alt="...">
            </p>
        </section>

        <hr>
        <section id="expect" class="text-center"><br>
            <h3>Mis expectativas</h3>
            <p>
                Mis expectativas son poder aplicar mis conocimientos en un entorno laboral real, ponerme a prueba a
                m&iacute;
                mismo con procesos o tareas a realizar las cuales supongan un reto, para as&iacute; desarrollar
                m&aacute;s mi l&oacute;gica y pensamiento anal&iacute;tico, logrando as&iacute; mejorar profesionalmente
                y poder
                aplicar a una plaza fija en la empresa de Creativa Consultores. Aprender m&aacute;s sobre temas que para
                m&iacute; son desconocidos actualmente y ponerlos en pr&aacute;tica en situaciones reales.
                De igual manera espero poder cumplir de manera satisfactoria lo que se espera de m&iacute; en estos
                meses
                <img src="resources/pasantia.jpg" width="400px" height="300px" class="rounded mx-auto d-block"
                    alt="...">

            </p>
        </section>

    </div>

    <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"
        integrity="sha384-MrcW6ZMFYlzcLA8Nl+NtUVF0sA7MsXsP1UyJoMp4YLEuNSfAP+JcXn/tWtIaxVXM"
        crossorigin="anonymous"></script>
    <script src="https://code.jquery.com/jquery-3.6.2.min.js"
        integrity="sha256-2krYZKh//PcchRtd+H+VyyQoZ/e3EcrkxhM8ycwASPA=" crossorigin="anonymous"></script>
    <script src="https://cdn.datatables.net/1.13.1/js/jquery.dataTables.min.js"></script>
    <script src="https://cdn.datatables.net/plug-ins/1.10.15/i18n/Spanish.json"></script>
    <script>
        $(document).ready(function () {
            $('#lenguajesT').DataTable();
        });
    </script>
</body>

</html>